# Ultralytics YOLO11-Large + P2 + SPDConv + EMA for VisDrone

# Parameters
nc: 10 # number of classes
scales:
  l: [1.00, 1.00, 512]

# Backbone (SPD-Conv 替代 stride=2 的 Conv)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (Stem通常保持原样，也可以换SPD但保持稳定建议不动)
  - [-1, 1, SPDConv, [128]]   # 1-P2/4 <--- SPD-Conv 替代 Conv(s=2)，保留更多小目标信息
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, SPDConv, [256]]   # 3-P3/8 <--- SPD-Conv
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, SPDConv, [512]]   # 5-P4/16 <--- SPD-Conv
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SPDConv, [1024]]  # 7-P5/32 <--- SPD-Conv
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, EMA, [1024]]      # 10 <--- EMA 替代 C2PSA，增强全局特征建模

# Head (With P2)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  # --- P2 层融合 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2 (SPDConv后的特征)
  - [-1, 2, C3k2, [128, False]] # 19 (P2/4-tiny)

  # --- 检测头输出 ---
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 22 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5 (注意这里连接的是EMA的输出)
  - [-1, 2, C3k2, [1024, True]] # 28 (P5/32-large)

  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)